somros/v6665_OY/atlantis/atassess/atsamplesetup.c
/**
 \file
 \brief Initialises assessment model arrays and reads-in assessment parameters
 \ingroup atassess

 File:       atsamplesetup.c

 Author:	    Beth Fulton

 date:	    26/8/2004

 comments:   Initialises assessment model arrays and reads-in assessment
 parameters

 revisions:  26/8/2004 Created from initialisation parts of sesample.c

 11/9/2004 Removed arrays used in Ecopath calculations
 (no longer required)

 18/9/2004 Added creation of the stock assessment arrays

 7/10/2004 Added arrays and strong vectors additional bioloigcal groups
 (PWN, BFF, BML, FBP, FDE, FDF, FVB, SHR, SSK, REP, SP, WDG). Also
 added the spInvName vector.

 22/10/2004 Replaced K_num_tot with K_num_tot_assess

 19/1/2005 Added Microphytobenthos


 02-02-2009 Bec Gorton
 Added code to free up the bm->rand and bm->tassPatchy arrays.
 Also added some code to check that the numsamples will be greater than one.
 If not the code will quit with an error message.
 This check is currently commented out for debugging purposes as its often
 useful to run short models.

 14-04-2009 Bec Gorton
 Changed the code that allocated the CPUETrend array. If pseudo_assess is true
 then space is allocated for each year of the model run regardless of the
 tassessstart value.

 03-01-2009 Beth Fulton
 Changed first tassess data to tassesststart+tassessinc (so don't get 3 samples in the first year instead of two)

 22-04-2009 Bec Gorton
 Added the atassesssModule code. This structure is used to contain the
 assessment arrays and state data.

 02-11-2009 Bec Gorton
 Changed the assessment xml file to use the management input file name as a guide.

 09-03-2010 Bec Gorton
 Resized all K_num_vert_sp arrays.

 07-04-2010 Bec Gorton
 Resized the invstockinfo array from bm->K_num_invfished to K_num_tot_sp
 Resized the globalfledge array from K_num_charis to K_num_tot_sp
 Resized the food array from bm->K_num_eweinvert + bm->K_num_detritus to k_num_tot_sp, 2;
 Removed the global array contribvert - its now just a local array in the function that its used.
 Removed the rhsmat and coefftmat arrays - its also now a local array.

 12-04-2010 Bec Gorton
 Resized the oi array.
 Resized all the network arrays from :

 (double **) alloc2d(bm->nfzones + 1, bm->K_num_tot_assess + 1);
 to:
 (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_assess + 1);

 Resized the following:

 bioleat = (double **) alloc2d(bm->nbox, bm->K_num_eat);
 biolprod = (double **) alloc2d(bm->nbox, bm->K_num_prod);
 to:

 bioleat = (double **) alloc2d(bm->nbox, bm->K_num_tot_sp);
 biolprod = (double **) alloc2d(bm->nbox, bm->K_num_tot_sp);

 12-05-2010 Bec Gorton
 Resize the sampleprod array to from K_num_prop to K_num_tot_sp.
 Resized the sampleeat array from K_num_eat to K_num_tot_sp.

 14-05-2010 Bec Gorton
 Trunk merge 1558.

 13-07-2010 Bec Gorton
 Removed the last references to K_num_macarofauna

 13-07-2010 Bec Gorton
 Removed spInvName.

 20-10-2010 Bec Gorton
 Removed all references to bm->K_num_charis.
 *************************************************************************/

#include <stdarg.h>
#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <signal.h>
#include <math.h>
#include <string.h>
#include <sjwlib.h>
#include "atsample.h"
#include "atsamplesetup.h"
#include <convertXML.h>

static void Setup_Biased_Sample_Values(MSEBoxModel *bm, FILE *llogfp);

/**
 * \brief Initialise the assessment model.
 */
void Assess_Init(MSEBoxModel *bm, FILE *llogfp) {

	int i, b, nk, nyr, max_nbs, nkk, numageclass, maxageclass, nsp, numyears, numsamples, sp, nf;
	double max_avail = 0;
	char convertedXMLFileName[STRLEN];

	if (verbose)
		fprintf(stderr, "Initialise assessment model\n");

	TINY = 1.0e-20;
	minpool = 1.0e-6;

	sprintf(convertedXMLFileName, "%s", bm->assessprmIfname);

	/* If the input file is a prm file convert it to the XML format */
	if(strstr(bm->assessprmIfname, ".xml") == NULL){
		/* Build the converted filename */
		*(strstr(convertedXMLFileName, ".prm")) = '\0';
		strcat(convertedXMLFileName, ".xml");

		/* Convert the input file to XML */
		Convert_Assess_To_XML(bm, bm->assessprmIfname, convertedXMLFileName);
	}

	readModelAssessmentParameters(bm, convertedXMLFileName);

	Setup_Biased_Sample_Values(bm, llogfp);

	/* Setup preference matrix array */
	dietpref = (double ****) alloc4d(bm->K_num_max_stages, bm->K_num_tot_sp, bm->K_num_max_stages, bm->K_num_tot_sp);

	/* Copy over consumer status to integer vector and free read-in vector
	 in Set_Preference_Matrix() */
	//    for (i=0; i<bm->K_num_tot_assess; i++)
	//        CON[i] = (int)(CONii[i]);

	/**** Memory allocation *******************************************************/
	/* NOTES on arrays - particularly sampling arrays and what each vetcor is storing

	 1. Groups follow id number given in setConstantID()

	 2. size bins assumes:
	 [0][group][zone][bin] = weights
	 [1][group][zone][bin] = numbers in stock
	 [2][group][zone][bin] = numbers in catch
	 [3][group][zone][bin] = numbers in discards
	 [4][group][zone][bin] = numbers for selectivity estimate


	 3. Stock arrays use:
	 [0][group][zones] = biomass
	 [1][group][zones] = total numbers in the stock
	 [2][group][zones] = numbers in the catch
	 [3][group][zones] = production
	 [4][group][zones] = consumption
	 [5][group][zones] = numbers in the discards (across fisheries)
	 [6][group][zones] = total catch (across fisheries)
	 [7][group][zones] = total effort (across fisheries)
	 [8][group][zones] = discards (across fisheries)
	 [9][group][zones] = size at maturity


	 4. Invert stock arrays use:
	 [0][group][zones] = total catch (across fisheries)
	 [1][group][zones] = total effort (across fisheries)
	 [2][group][zones] = discards (across fisheries)

	 Note: this replaced samplecatch[][], samplediscards[][]
	 and sampleeffort [][]

	 5. The individual arrays use:
	 [0][size][zones] = weight
	 [1][size][zones] = numbers in the stock
	 [2][size][zones] = numbers in the catch
	 [3][size][zones] = biomass
	 [4][size][zones] = discards
	 [5][size][zones] = q
	 [6][size][zones] = condition

	 Note for birds only use the first 3 size bins, as only classified as
	 fledgling, juvenile and adult not actually sized
	 */

	/* Constants */
	samplearea = (double *) alloc1d(bm->nsbox);
	totalarea = (double *) alloc1d(bm->nsbox);
	zonearea = (double *) alloc1d(bm->nfzones);
	zoneboxes = (int *) i_alloc1d(bm->nfzones);

	/* Data storage */
	biolbiom = (double ***) alloc3d(2, bm->nbox, bm->K_num_tot_sp);
	bioleat = (double **) alloc2d(bm->nbox, bm->K_num_tot_sp);
	biolprod = (double **) alloc2d(bm->nbox, bm->K_num_tot_sp);
	biolVERTinfo = (double ****) alloc4d(bm->nbox, bm->K_num_max_cohort * bm->K_num_max_genetypes, bm->K_num_tot_sp, 7);

	phys = (double **) alloc2d(bm->nbox, num_sampled_phy_id);
	physprocess = (double **) alloc2d(bm->nbox, 3);

	/* Sampled data (mostly fisheries independent) */
	individVERTinfo = (double *****) alloc5d(2, bm->nfzones, bm->K_num_tot_sp, bm->K_num_size, K_num_individ_char);

