somros/v6665_OY/atlantis/atassess/atsamplesetup.c
	invstockinfo = (double ****) alloc4d(2, bm->nfzones, bm->K_num_tot_sp, 3);
	pop_fraction = (double ***) alloc3d(bm->nfzones, bm->K_num_tot_sp, 2);
	samplebiom = (double ***) alloc3d(2, bm->nfzones, bm->K_num_tot_sp);
	sampledetbiom = (double ****) alloc4d(2, bm->nfzones, 2, bm->K_num_detritus);
	sampleeat = (double ***) alloc3d(2, bm->nfzones, bm->K_num_tot_sp);
	samplephys = (double ***) alloc3d(2, bm->nfzones, num_sampled_phy_id - 2); // Don't need to sample depth and area.
	sampleprocess = (double ***) alloc3d(2, bm->nfzones, 3);
	sampleprod = (double ***) alloc3d(2, bm->nfzones, bm->K_num_tot_sp);
	stockinfo = (double ****) alloc4d(2, bm->nfzones, bm->K_num_tot_sp, 11);

	/* Fisheries data */
	agelengthkey = (double *****) alloc5d(2, bm->nfzones, bm->K_num_tot_sp, bm->K_max_agekey, bm->K_num_size);
	agebins = (double *****) alloc5d(2, bm->K_num_size, bm->K_max_agekey, bm->nfzones, bm->K_num_tot_sp);
	fishery = (double *****) alloc5d(2, bm->nbox, bm->K_num_tot_sp, bm->K_num_fisheries, 3);
	samplenums = (double **) alloc2d(3, bm->K_num_sampleage);
	sizebins = (double ******) alloc6d(2, 2, bm->K_num_size, bm->nfzones, bm->K_num_tot_sp, 5);

	/* Diet information */
	inshorediet = (double ****) alloc4d(2, bm->K_num_tot_sp, 2, bm->K_num_tot_sp);
	intruediet = (double ****) alloc4d(2, bm->K_num_tot_sp, 2, bm->K_num_tot_sp);
	offshorediet = (double ****) alloc4d(2, bm->K_num_tot_sp, 2, bm->K_num_tot_sp);
	offtruediet = (double ****) alloc4d(2, bm->K_num_tot_sp, 2, bm->K_num_tot_sp);
	totareadiet = (double ****) alloc4d(2, bm->K_num_tot_sp, 2, bm->K_num_tot_sp);
	tottruediet = (double ****) alloc4d(2, bm->K_num_tot_sp, 2, bm->K_num_tot_sp);
	TL = (double ***) alloc3d(2, bm->K_num_tot_sp, 6);
	trueTL = (double ***) alloc3d(2, bm->K_num_tot_sp, 6);

	/*
	 * Replace K_num_tot_assess with
	 * [k_num_tot_sp][2] to allow for adult juv values.
	 * Just not sure what to do about the sediment values
	 * If i include these i end up with a 6D array which is just silly
	 *
	 * I could just have a WC or SED value for the prey as detritus is not a predator.
	 *
	 * So it would be:
	 * K_num_tot_sp, 2, K_num_tot_sp, 2, 2
	 */
	//inshorediet = (double **) alloc2d(bm->K_num_tot_assess, bm->K_num_tot_assess);

	/* Temporary data processing arrays */
	maxageclass = 0;
	for (nsp = 0; nsp < bm->K_num_tot_sp; nsp++) {
		//if (FunctGroupArray[nsp].isVertebrate == TRUE ) {
		if (FunctGroupArray[nsp].isVertebrate == TRUE && FunctGroupArray[nsp].speciesParams[flag_id]) {
			if (!FunctGroupArray[nsp].ageClassSize)
				quit("%s ageclass size set to 0 in biology.prm correct this and restart (set to 1 if group not active)\n", FunctGroupArray[nsp].groupCode);

			if (FunctGroupArray[nsp].ageClassSize > maxageclass)
				maxageclass = FunctGroupArray[nsp].ageClassSize;
		}
	}
	numageclass = maxageclass * bm->K_num_max_cohort * bm->K_num_max_genetypes;

	altavailfood = (double ****) alloc4d(2, bm->K_num_tot_sp, 2, bm->K_num_tot_sp);
	availfood = (double ****) alloc4d(2, bm->K_num_tot_sp, 2, bm->K_num_tot_sp);

	//new_altavailfood = (double **) alloc2d(2 * bm->K_num_tot_sp, 2 * bm->K_num_tot_sp);
	//new_availfood = (double **) alloc2d(2 * bm->K_num_tot_sp, 2 * bm->K_num_tot_sp);

	//printf("Creating sample arrays\n");

	contribvert = Util_Alloc_Init_2D_Double(2, bm->K_num_tot_sp, 0.0);
	biom = (double ***) alloc3d(2, bm->nfzones, bm->K_num_tot_sp);
	globalnums = (double ***) alloc3d(2, 2, bm->K_num_tot_sp);
	nsq = (int ****) i_alloc4d(2, bm->K_num_size, bm->nfzones, bm->K_num_tot_sp);
	nums = (double **) alloc2d(2, bm->K_num_tot_sp);
	num_nyr = (double **) alloc2d(2, numageclass);
	oldbaby = (double ***) alloc3d(2, bm->nfzones, bm->K_num_tot_sp);
	totn = (double *) alloc1d(3);
	totnums = (double ***) alloc3d(bm->nfzones, bm->K_num_tot_sp, 4);
	totsamplebiom = (double **) alloc2d(bm->nfzones + 1, 3);
	checkedz = (int *) i_alloc1d(bm->nfzones);

	/* Network calculation arrays */
	biomnetwk = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp + 1);
	eatnetwk = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp + 1);
	exportnetwk = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp + 1);
	importnetwk = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp + 1);
	mortnetwk = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp + 1);
	prodnetwk = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp + 1);
	respnetwk = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp + 1);

	/* Network indice calculation arrays */
	cvsample = (double ***) alloc3d(bm->nfzones, bm->K_num_tot_sp, 3);
	divfn = (int **) i_alloc2d(bm->nfzones, bm->K_num_tot_sp);
	divsp = (int **) i_alloc2d(bm->nfzones, bm->K_num_tot_sp);
	cvphys = (double ***) alloc3d(bm->nfzones, num_sampled_phy_id + 1, 3);
	physicalSigma = (double **) alloc2d(bm->nfzones, num_sampled_phy_id);

	/* Allow for the sediment and wc value of detritus  - could possibly be smarter about this or split them.*/
	//food = (double *) alloc2d(2, bm->K_num_tot_sp);

	globalfledge = (double **) alloc2d(bm->K_num_tot_sp, 3);
	globalpd = (double **) alloc2d(6, 2);
	mineat = Util_Alloc_Init_2D_Double(2, bm->nfzones + 1, MAXDOUBLE);
	numsort = (int *) i_alloc1d(bm->K_num_tot_sp);
	oi = (double ***) alloc3d(2, bm->K_num_tot_sp, 3);
	PBRglobal = (double **) alloc2d(2, bm->K_num_tot_sp);
	permpivot = (int *) i_alloc1d(bm->K_num_tot_sp * 2);

	stomachs = (int **) i_alloc2d(2, bm->K_num_tot_sp);
	upper = (double *) alloc1d(2 * bm->K_num_tot_sp);
	lower = (double *) alloc1d(2 * bm->K_num_tot_sp);
	zasum = (double *) alloc1d(bm->nfzones + 1);

	MultiNom_binIndex = (int *)i_alloc1d(2* bm->K_num_tot_sp);
	MultiNom_cohortIndex= (int *)i_alloc1d(2* bm->K_num_tot_sp);

	/* Arrays for indices */
	avgtl = (double **) alloc2d(bm->nfzones + 2, 8);
	cvt = (double *) alloc1d(bm->nfzones + 1);
	endnums = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp);
	endnumsbig = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_tot_sp); // as K_num_microfauna includes K_num_bacteria
	disrate = (double *) alloc1d(bm->nfzones + 1);
	divindx = (int **) i_alloc2d(bm->nfzones + 1, 2);
	fledge = (double **) alloc2d(bm->nfzones + 1, bm->K_num_tot_sp * 2);
	habindx = (double **) alloc2d(bm->nfzones + 1, 2);
	monbet = (double **) alloc2d(bm->nfzones + 1, 2);
	netwkindx = (double **) alloc2d(bm->nfzones + 1, K_netwk_properties);
	nppb = (double *) alloc1d(bm->nfzones + 1);
	PBRcat = (double **) alloc2d(bm->nfzones + 1, bm->K_num_tot_sp);
	pd = (double **) alloc2d(bm->nfzones + 1, 3);
	pdcat = (double **) alloc2d(bm->nfzones + 1, 3);
	pelbin = (double ***) alloc3d(bm->nfzones + 1, 2, bm->K_num_pelbin);
	sedbin = (double **) alloc2d(bm->nfzones + 1, bm->K_num_sedbin);
	soi = (double *) alloc1d(bm->nfzones + 1);
	trophspect = (double ***) alloc3d(bm->nfzones + 2, 2, bm->K_num_trophbin);

	max_lngth = (double **) alloc2d(3, bm->nfzones + 1);
	bm->rep_box_of_zone = (int ***) i_alloc3d(2, bm->nfzones, bm->K_num_tot_sp);

	/* Stock assessment arrays */
    if (bm->tassessstart > (bm->tstop / 86400.0)){
    	if(bm->pseudo_assess == TRUE){
    		nyr = (int)floor(ROUNDGUARD + ((bm->tstop - bm->tstart)/(86400.0*365.0) + 1.0));
    	}else
    		nyr = 1;
    }else{
        nyr = (int)floor(ROUNDGUARD + (((bm->tstop / 86400.0) - bm->tassessstart)/365.0 + 1.0));
    }

    if(nyr < 0){
    	fprintf(stderr, "ERROR - initAssess. The assessment model has determined that the number of years %d which is a negative number.\nCheck your tassessstart values in your assessment input file\n", nyr);
    	quit("");
    }

	CPUEtrend = (double **) alloc2d(nyr, bm->K_num_tot_sp);

	nk = bm->K_num_max_cohort * bm->K_num_max_genetypes * nyr + 1;
	BootResu = (double *) alloc1d(nk);
	CData = (double **) alloc2d(bm->K_num_max_cohort * bm->K_num_max_genetypes, nyr);
	IData = (double **) alloc2d(bm->K_num_max_cohort * bm->K_num_max_genetypes, nyr);
	IDatahat = (double **) alloc2d(bm->K_num_max_cohort * bm->K_num_max_genetypes, nyr);

	if (bm->K_num_max_cohort * bm->K_num_max_genetypes > num_est_prm)
		nk = bm->K_num_max_cohort * bm->K_num_max_genetypes;
	else
		nk = num_est_prm;

	NEst = (double **) alloc2d(nk, nyr);
	Resu = (double **) alloc2d(nk, nyr);
	F = (double **) alloc2d(nk, nyr);
	P = (double **) alloc2d(nk, nk);
	X = (double *) alloc1d(nk);
	Y = (double *) alloc1d(nk);

	nkk = (int) floor(ROUNDGUARD + (floor(bm->tstop / 365.0)));
	if (nkk < 1)
		nkk = 1;
	XX = (double *) alloc1d(nkk);
	YY = (double *) alloc1d(nkk);

	max_nbs = 0;
	for (i = 0; i < bm->K_num_tot_sp; i++) {
		if (FunctGroupArray[i].isFished == TRUE) {
			if ((int) (FunctGroupArray[i].speciesParams[assess_bootstrap_id]) > max_nbs)
				max_nbs = (int) (FunctGroupArray[i].speciesParams[assess_bootstrap_id]);
		}
	}

	nk = max_nbs + 2; // One spare in case of overlaps
	NResult = (double ***) alloc3d(nk, bm->K_num_max_cohort * bm->K_num_max_genetypes, nyr);
	ResultToSort = (double *) alloc1d(nk);
	ResultSorted = (double *) alloc1d(nk);
	nbsSort = (int *) i_alloc1d(nk);

	//fprintf(llogfp, "nk: %d\n", nk);

	/* Determine maximum vertebrate ageclass size */
	zoneVERTpopratio = (double ****) alloc4d(bm->nfzones, bm->maxspage, bm->K_num_max_cohort * bm->K_num_max_genetypes, bm->K_num_tot_sp);

	/* Setup preference matrix */
	Set_Preference_Matrix(bm, llogfp);

	/* Initialise arrays */
	for (i = 0; i < bm->nfzones; i++) {
		zonearea[i] = 0.0;
		for (b = 0; b < 8; b++)
			avgtl[b][i] = 0.0;
	}

	for (b = 0; b < bm->nsbox; b++) {
		samplearea[b] = 0.0;
		totalarea[b] = 0.0;
	}

	bm->tassess = bm->tassessstart + bm->tassessinc;
	bm->teatassess = bm->tassessstart + bm->teatassessinc;
	datain = 0;
	firstdata = 1;

	numsteps = (int) (floor(364.0 / bm->tassessinc + 0.5));
	numsteps_orig = numsteps;

