somros/v6665_OY/atlantis/atassess/atsamplesetup.c
	//fprintf(llogfp, "tassess: %e, numsteps: %d, tassessinc: %e, ratio: %e\n", bm->tassess, numsteps, bm->tassessinc, 364.0 / bm->tassessinc);

	if (numsteps < 0) {
		numsteps_orig = 0;
		numsteps = 1;
	}

	if (bm->flagcont && (numsteps > 0) && ((numsteps * bm->tassessinc) > 364)) {
		quit(
				"With the current configuration of tassessinc (%e) which gives numsteps = %d annual samping will fail as would happen after end of year, so won't happen as reset for the new year\n",
				bm->tassessinc, numsteps);
	}

	bm->sample_now = 1;
	bm->annual_assess = 0;
	if (numsteps_orig < 1) {
		bm->annual_assess = 1;
	}

	//printf("numsteps %d, floor: %e, bracket: %e, annual_assess: %d\n", numsteps, (double)floor(364.0 / bm->tassessinc + 0.5),
	//		(double)floor(364.0 / bm->tassessinc + 0.5) - 1.0, bm->annual_assess);

	/** Set up random arrays - strating by defining actual arrays **/
	numyears = (int) (ceil((bm->tstop - bm->tstart) / (365.0 * 86400.0)));
	numsamples = (int) (ceil((bm->tstop - bm->tstart) / (bm->minfreq * 86400.0)));

	bm->rand = (double ***) alloc3d(numyears, nrand_id, bm->K_num_tot_sp);

	/* Numsamples +1 for time 0 and extra +1 for time after tstop (never executed but so don't trip nextij++) */
	bm->tassPatchy = (double **) alloc2d(2, numsamples + 2);

	/* Open the output files in the Assessment Module */
	Open_Attribute_Files(bm);
	Open_Index_Files(bm);

	/* Handle random number generation */

	if (bm->flagrandom == 1) {
		if (bm->flaggen == 1) {
			/* Generate and record random numbers */
			for (b = 0; b < numsamples; b++) {
				bm->tassPatchy[b][tass_id] = bm->tassessinc / drandom(bm->minfreq, bm->maxfreq);
				bm->tassPatchy[b][tasseat_id] = bm->teatassessinc / drandom(bm->minfreq, bm->maxfreq);
			}
			for (i = 0; i < bm->K_num_tot_sp; i++) {
				if (FunctGroupArray[i].isFished == TRUE) {
					for (b = 0; b < numyears; b++) {
						bm->rand[i][startN_id][b] = Assess_Add_Error(bm, flagprms, 1.0, k_avgprms, k_varprms);
						bm->rand[i][calcF_id][b] = Assess_Add_Error(bm, flagprms, 1.0, k_avgprms, k_varprms);
						bm->rand[i][calcM_id][b] = Assess_Add_Error(bm, flagprms, 1.0, k_avgprms, k_varprms);
					}
				}
			}
			Write_Random_Numbers(bm, numyears, numsamples);
		}
	} else {
		/* No randomisation so make all scalars 1.0 */
		for (b = 0; b < numsamples; b++) {
			bm->tassPatchy[b][tass_id] = 1.0;
			bm->tassPatchy[b][tasseat_id] = 1.0;
		}
		for (i = 0; i < bm->K_num_tot_sp; i++) {
			if (FunctGroupArray[i].isFished == TRUE) {
				for (b = 0; b < numyears; b++) {
					bm->rand[i][startN_id][b] = 1.0;
					bm->rand[i][calcF_id][b] = 1.0;
					bm->rand[i][calcM_id][b] = 1.0;
				}
			}
		}
	}

	/* No patch sampling so set scalar to 1.0 */
	if (bm->flagpatchy != 1) {
		for (b = 0; b < numsamples; b++) {
			bm->tassPatchy[b][tass_id] = 1.0;
			bm->tassPatchy[b][tasseat_id] = 1.0;
		}
	}
	nextij = 0;
	nexteatij = 0;

	/* Find the primary fishery to sample */
	for (sp = 0; sp < bm->K_num_tot_sp; sp++) {
		if (FunctGroupArray[sp].isVertebrate == TRUE) {
			max_avail = 0;
			for (nf = 0; nf < bm->K_num_fisheries; nf++) {
				if (bm->SP_FISHERYprms[sp][nf][avail_id] > max_avail) {
					FunctGroupArray[sp].speciesParams[primary_fishery_id] = nf;
					max_avail = bm->SP_FISHERYprms[sp][nf][avail_id];
				}
			}
		}
	}

	return;

}

/*************************** Model ID Set-up Routines ****************************/
/**
 * \brief This routine names the classical assessment parameters that are estimated
 */
void Assess_Set_Name_ID(MSEBoxModel *bm) {
	sprintf(bm->NAssessNAME[est_med_recruit_id], "%s", "Med_Recruit");
	sprintf(bm->NAssessNAME[est_top_recruit_id], "%s", "Top_Recruit");
	sprintf(bm->NAssessNAME[est_bot_recruit_id], "%s", "Bott_Recruit");
	sprintf(bm->NAssessNAME[est_med_prm2_id], "%s", "Med_Prm2");
	sprintf(bm->NAssessNAME[est_top_prm2_id], "%s", "Top_Prm2");
	sprintf(bm->NAssessNAME[est_bot_prm2_id], "%s", "Bott_Prm2");
	sprintf(bm->NAssessNAME[est_med_stock_id], "%s", "Med_Stock");
	sprintf(bm->NAssessNAME[est_top_stock_id], "%s", "Top_Stock");
	sprintf(bm->NAssessNAME[est_bot_stock_id], "%s", "Bott_Stock");
	sprintf(bm->NAssessNAME[est_SS_id], "%s", "Sum_Sq");
	sprintf(bm->NAssessNAME[est_FrefA_id], "%s", "FrefA");
	sprintf(bm->NAssessNAME[est_FrefC_id], "%s", "FrefC");
	sprintf(bm->NAssessNAME[est_Fcurr_id], "%s", "Fcurr");
	sprintf(bm->NAssessNAME[est_M_id], "%s", "M_est");
	sprintf(bm->NAssessNAME[est_Ccurr_id], "%s", "AvgCurrentCatch");
	sprintf(bm->NAssessNAME[est_Cslope_id], "%s", "CPUEtrend");
	sprintf(bm->NAssessNAME[est_numyr_id], "%s", "CPUErun");
	sprintf(bm->NAssessNAME[est_CPUEnow_id], "%s", "CPUEnow");
	sprintf(bm->NAssessNAME[est_CPUEstart_id], "%s", "CPUEtrendStart");

	return;
}

/******************** Free assessment arrays ***************************/
void Assess_Free(MSEBoxModel *bm) {

    printf("Doing Assess_Free\n");
    
	if(bm->useRBCTiers)
		Tier_Assessment_Free(bm);

    i_free1d(bm->nsboxes);
	i_free1d(bm->nsboxes_other);
	i_free1d(bm->nsboxes_intense);
	free2d(detrit_import);
	free2d(DiscardFate);
    
    i_free1d(InOffshorei);
	free4d(dietpref);
	free1d(samplearea);
	free1d(totalarea);
	free1d(zonearea);
	i_free1d(zoneboxes);
	free3d(biolbiom);
	free2d(bioleat);
	free2d(biolprod);
	free4d(biolVERTinfo);
    
    free2d(phys);
	free2d(physprocess);
	free5d(individVERTinfo);
	free4d(invstockinfo);
	free3d(pop_fraction);
	free3d(samplebiom);
	free4d(sampledetbiom);
	free3d(sampleeat);
	free3d(samplephys);
	free3d(sampleprocess);
    
    free3d(sampleprod);
	free4d(stockinfo);
	free5d(agelengthkey);
	free5d(agebins);
	free5d(fishery);
	free2d(samplenums);
	free6d(sizebins);
	free4d(inshorediet);
	free4d(intruediet);
	free4d(offshorediet);
	free4d(offtruediet);
	free4d(totareadiet);
	free4d(tottruediet);
    
    free3d(TL);
	free3d(trueTL);
	free4d(altavailfood);
	free4d(availfood);

	//free2d(new_altavailfood);
	//free2d(new_availfood);

    free2d(contribvert);
	free3d(biom);
	free3d(globalnums);
	i_free4d(nsq);
	free2d(nums);
	free3d(oldbaby);
	free1d(totn);
	free3d(totnums);
	free2d(totsamplebiom);
	free3d(biomnetwk);
	free3d(eatnetwk);
	free3d(exportnetwk);
	free3d(importnetwk);
	free3d(mortnetwk);
	free3d(prodnetwk);
	free3d(respnetwk);
    
    free3d(cvsample);
	free2d(physicalSigma);
	free3d(cvphys);
	i_free2d(divfn);
	i_free2d(divsp);

	free2d(globalfledge);
    
    free2d(globalpd);
	free2d(mineat);
	i_free1d(numsort);
	free3d(oi);
	free2d(PBRglobal);
	i_free1d(permpivot);
	i_free2d(stomachs);
	free1d(upper);
	free1d(lower);
	i_free1d(MultiNom_binIndex);
	i_free1d(MultiNom_cohortIndex);
	free1d(zasum);
	free2d(avgtl);
	free1d(cvt);
	free3d(endnums);
    
