somros/v6665_OY/atlantis/atassess/atsamplesetup.c
    free3d(endnumsbig);
	free1d(disrate);
	i_free2d(divindx);
	free2d(fledge);
	free2d(habindx);
	free2d(monbet);
	free2d(netwkindx);
	free1d(nppb);
	free2d(PBRcat);
	free2d(pd);
	free2d(pdcat);
	free3d(pelbin);
	free2d(sedbin);
    
    free1d(soi);
	free3d(trophspect);
	free2d(max_lngth);
	free1d(BootResu);
	free2d(CData);
	free2d(IData);
	free2d(IDatahat);
	free2d(NEst);
	free2d(Resu);
	free2d(F);
	free2d(P);
	free1d(X);
	free1d(Y);
    
    free3d(NResult);
	free1d(ResultToSort);
	free1d(ResultSorted);
	i_free1d(nbsSort);
	free4d(zoneVERTpopratio);
	i_free1d(checkedz);
	free2d(CPUEtrend);
	free2d(num_nyr);
	free1d(XX);
	free1d(YY);

	free3d(bm->rand);
	free2d(bm->tassPatchy);
	i_free3d(bm->rep_box_of_zone);
    
    /* Free up the error structure */
	free(spErrorStructure);

	/* Close the output files */
	Close_Attribute_Files(bm);
	Close_Index_Files(bm);
    
	return;
}

/**
 * \brief Populate the ErrorStructure for the given invert_type with the given values.
 */
static void Set_Species_Biased_Value(ErrorStructure *spErrorStructure, GROUP_TYPES type, int flag, double WC_k_avg_bb, double WC_k_var_bb,
		double SED_k_avg_bb, double SED_k_var_bb, double k_avg_pp, double k_var_pp, double k_avg_eat, double k_var_eat) {

	spErrorStructure[type].spErrorStructureFlag = flag;
	spErrorStructure[type].k_avg_Biomass[WC] = WC_k_avg_bb;
	spErrorStructure[type].k_var_Biomass[WC] = WC_k_var_bb;
	spErrorStructure[type].k_avg_Biomass[SED] = SED_k_avg_bb;
	spErrorStructure[type].k_var_Biomass[SED] = SED_k_var_bb;
	spErrorStructure[type].k_avg_pp = k_avg_pp;
	spErrorStructure[type].k_var_pp = k_var_pp;
	spErrorStructure[type].k_avg_eat = k_avg_eat;
	spErrorStructure[type].k_var_eat = k_var_eat;
}

/**
 * \brief Set the biased sample values for each invertebrate type.
 */
static void Setup_Biased_Sample_Values(MSEBoxModel *bm, FILE *llogfp) {

	spErrorStructure = (ErrorStructure *) malloc(sizeof(ErrorStructure) * NUM_GROUP_TYPES);

	Set_Species_Biased_Value(spErrorStructure, LG_PHY, flaginvpbiom, k_avgphytl, k_varphytl, 0, 0, k_avgpelpp, k_varpelpp, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, SM_PHY, flaginvpbiom, k_avgphyts, k_varphyts, 0, 0, k_avgpelpp, k_varpelpp, 0, 0);
	// TODO: no values read in for DF and its not handled in code. Need to check with Beth about this.
	Set_Species_Biased_Value(spErrorStructure, DINOFLAG, flagdetbiom, k_avgphyts, k_varphyts, 0, 0, k_avgpelpp, k_varpelpp, 0, 0);

	Set_Species_Biased_Value(spErrorStructure, SM_ZOO, flaginvpbiom, k_avgzoops, k_varzoops, 0, 0, k_avgzoopp, k_varzoopp, k_avgzoopeat, k_varzoopeat);
	Set_Species_Biased_Value(spErrorStructure, MED_ZOO, flaginvpbiom, k_avgzoopl, k_varzoopl, 0, 0, k_avgzoopp, k_varzoopp, k_avgzoopeat, k_varzoopeat);
	Set_Species_Biased_Value(spErrorStructure, LG_ZOO, flaginvpbiom, k_avgzoopl, k_varzoopl, 0, 0, k_avgzoopp, k_varzoopp, k_avgzoopeat, k_varzoopeat);
	Set_Species_Biased_Value(spErrorStructure, CEP, flaginvpbiom, k_avgcep, k_varcep, 0, 0, k_avgcepp, k_varcepp, k_avgcepeat, k_varcepeat);

	Set_Species_Biased_Value(spErrorStructure, SED_EP_FF, flagepibiom, k_avgepif1, k_varepif1, 0, 0, k_avgepi1p, k_varepi1p, k_avgepi1eat, k_varepi1eat);
	Set_Species_Biased_Value(spErrorStructure, SED_EP_OTHER, flagepibiom, k_avgepif1, k_varepif1, 0, 0, k_avgepi2p, k_varepi2p, k_avgepi2eat, k_varepi2eat);
	Set_Species_Biased_Value(spErrorStructure, CORAL, flagepibiom, k_avgepif1, k_varepif1, 0, 0, k_avgepi1p, k_varepi1p, k_avgepi1eat, k_varepi1eat);
    Set_Species_Biased_Value(spErrorStructure, SPONGE, flagepibiom, k_avgepif1, k_varepif1, 0, 0, k_avgepi1p, k_varepi1p, k_avgepi1eat, k_varepi1eat);
    
	Set_Species_Biased_Value(spErrorStructure, PWN, flagepibiom, k_avgepif2, k_varepif2, 0, 0, k_avgepi2p, k_varepi2p, k_avgepi2eat, k_varepi2eat);
	Set_Species_Biased_Value(spErrorStructure, MOB_EP_OTHER, flagepibiom, k_avgepif2, k_varepif2, 0, 0, k_avgepi2p, k_varepi2p, k_varepi2eat, k_varepi2eat);

	Set_Species_Biased_Value(spErrorStructure, PL_BACT, flaginvpbiom, k_avgpbact, k_varpbact, 0, 0, k_avgpbactp, k_varpbactp, k_avgpbacteat, k_varpbacteat);
	Set_Species_Biased_Value(spErrorStructure, SED_BACT, flaginvpbiom, k_avgsbact, k_varsbact, 0, 0, k_avgsbactp, k_varsbactp, k_avgsbacteat, k_varsbacteat);
	Set_Species_Biased_Value(spErrorStructure, ICE_BACT, flaginvpbiom, k_avgpbact, k_varpbact, 0, 0, k_avgpbactp, k_varpbactp, k_avgpbacteat, k_varpbacteat);
	// Treat ice bacteria like pelagic bacteria for now

	Set_Species_Biased_Value(spErrorStructure, SM_INF, flaginfbiom, k_avginfs, k_varinfs, 0, 0, k_avginfsp, k_varinfsp, k_avginfseat, k_varinfseat);
	Set_Species_Biased_Value(spErrorStructure, LG_INF, flaginfbiom, k_avginfl, k_varinfl, 0, 0, k_avginflp, k_varinflp, k_avginfleat, k_varinfleat);

	Set_Species_Biased_Value(spErrorStructure, PHYTOBEN, flagepibiom, k_avgppben, k_varppben, 0, 0, k_avgbenpp, k_varbenpp, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, MICROPHTYBENTHOS, flagepibiom, k_avgppben, k_varppben, 0, 0, k_avgbenpp, k_varbenpp, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, SEAGRASS, flagepibiom, k_avgppben, k_varppben, 0, 0, k_avgbenpp, k_varbenpp, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, TURF, flagepibiom, k_avgppben, k_varppben, 0, 0, k_avgbenpp, k_varbenpp, 0, 0);


	Set_Species_Biased_Value(spErrorStructure, ICE_DIATOMS, flaginvpbiom, k_avgphytl, k_varphytl, 0, 0, k_avgpelpp, k_varpelpp, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, ICE_MIXOTROPHS, flagdetbiom, k_avgphyts, k_varphyts, 0, 0, k_avgpelpp, k_varpelpp, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, ICE_ZOOBIOTA, flaginvpbiom, k_avgzoops, k_varzoops, 0, 0, k_avgzoopp, k_varzoopp, k_avgzoopeat, k_varzoopeat);

	Set_Species_Biased_Value(spErrorStructure, LAB_DET, flagdetbiom, k_avgldet, k_varldet, 0, 0, 0, 0, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, CARRION, flagdetbiom, k_avgldet, k_varldet, 0, 0, 0, 0, 0, 0);

	Set_Species_Biased_Value(spErrorStructure, REF_DET, flagdetbiom, k_avgrdet, k_varrdet, k_avgrdet, k_varrdet, 0, 0, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, LAB_DET, flagdetbiom, k_avgrdet, k_varrdet, k_avgrdet, k_varrdet, 0, 0, 0, 0);
	Set_Species_Biased_Value(spErrorStructure, CARRION, flagdetbiom, k_avgrdet, k_varrdet, k_avgrdet, k_varrdet, 0, 0, 0, 0);

}
